Revit 2024 API
RevisionCloud.IsRevisionIssued Method
 Indicates whether the Revision associated with this RevisionCloud has been issued.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool IsRevisionIssued()
Visual Basic
Public Function IsRevisionIssued As Boolean
Visual C++
public:
bool IsRevisionIssued()
Return Value
 True if the Revision has been issued, False otherwise.
See Also
RevisionCloud Class
Autodesk.Revit.DB Namespace